# data-database-types-relational-language-SQL-MySQL-_C_RUD-create-command-INSERT-INTO
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- command - mysql - **add** **information** to **databases** [1]

```sql
INSERT INTO <table> VALUES (value1, value2, valueN);
```

```sql
INSERT INTO <table> (column1, column2, columnN)
            VALUES (value1, value2, valueN);
```

[MySQL Documentation](https://web.archive.org/web/20200616172821/https://dev.mysql.com/doc/refman/8.0/en/insert.html)

```sql
mysql> use lab5;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab5 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------+------+------+-----------+
| personID | name  | age  | sex  | isStudent |
+----------+-------+------+------+-----------+
|        1 | John  |   23 | M    |         1 |
|        2 | Mary  |   30 | F    |         0 |
|        3 | Tom   | NULL | M    |         0 |
|        4 | Alan  |   18 | M    |         1 |
|        5 | Laura |   17 | F    |         1 |
|        6 | Bob   |   18 | M    |         0 |
+----------+-------+------+------+-----------+
6 rows in set (0.00 sec)
```

- table - entity - relation - person - **command** - **DESCRIBE** - **schema** - **Field** - five **columns** - attributes - fields - personID - name - age - sex - isStudent - **schema** - **Type** - **data** **type** - for each row - record - tuple [1]

```sql
mysql> DESCRIBE person;
+-----------+---------------+------+-----+---------+----------------+
| Field     | Type          | Null | Key | Default | Extra          |
+-----------+---------------+------+-----+---------+----------------+
| personID  | int           | NO   | PRI | NULL    | auto_increment |
| name      | varchar(20)   | NO   |     | NULL    |                |
| age       | int           | YES  |     | NULL    |                |
| sex       | enum('M','F') | YES  |     | M       |                |
| isStudent | tinyint(1)    | YES  |     | 0       |                |
+-----------+---------------+------+-----+---------+----------------+
5 rows in set (0.00 sec)
```

- **command** - **INSERT** **INTO** - **table** - entity - relation - person - **keyword** - **VALUES** - followed by a **list** of the **values** to **be** **inserted** [1]

- **order** of the **values** - **inserted** - are the **same** as the **order** of the **columns** - attributes - fields - **returned** by - **command** - **DESCRIBE** [1]

```sql
mysql> INSERT
    -> INTO person
    -> VALUES (7,"Johnny",23,"M",1);
Query OK, 1 row affected (0.01 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+--------+------+------+-----------+
| personID | name   | age  | sex  | isStudent |
+----------+--------+------+------+-----------+
|        1 | John   |   23 | M    |         1 |
|        2 | Mary   |   30 | F    |         0 |
|        3 | Tom    | NULL | M    |         0 |
|        4 | Alan   |   18 | M    |         1 |
|        5 | Laura  |   17 | F    |         1 |
|        6 | Bob    |   18 | M    |         0 |
|        7 | Johnny |   23 | M    |         1 |
+----------+--------+------+------+-----------+
7 rows in set (0.00 sec)
```

- column - attribute - field - personID - **schema** - **Key** - PRI - **primary** **key** - **uniquely** **identifies** a **row** - record - tuple - in a **table** - entity - relation [1]

- **schema** - **NULL** - NO - **must** be **unqiue** - **not** **null** [1]

- **schema** - **Extra** - **auto_increment** - do **not** **need** to **specify** a **value** - **mysql** ensures **uniqueness** [1]

```sql
mysql> DESCRIBE person;
+-----------+---------------+------+-----+---------+----------------+
| Field     | Type          | Null | Key | Default | Extra          |
+-----------+---------------+------+-----+---------+----------------+
| personID  | int           | NO   | PRI | NULL    | auto_increment |
| name      | varchar(20)   | NO   |     | NULL    |                |
| age       | int           | YES  |     | NULL    |                |
| sex       | enum('M','F') | YES  |     | M       |                |
| isStudent | tinyint(1)    | YES  |     | 0       |                |
+-----------+---------------+------+-----+---------+----------------+
5 rows in set (0.00 sec)
```

- even though mysql ensures uniqueness for the column - attribute - field - personID [1] 

```sql
ERROR 1136 (21S01): Column count doesn't match value count at row 1
```

```sql
mysql> INSERT
    -> INTO person
    -> VALUES ("Mary",30,"F",0);
ERROR 1136 (21S01): Column count doesn't match value count at row 1
```

- **table** - entity - relation - has **five** **columns** - attributes - fields - personID - name - age - sex - isStudent - **command** - **INSERT** **INTO** - only **specifying** values for **four** **columns** - attributes - fields - name - age - sex - isStudent - **mysql** - does **not** **know** **where** to **insert** the values [1]

- **must** **specify** which **columns** - attributes - fields - these **values** **relate** **to** [1]

- **no** **value** **specified** for **column** - attribute - field - personID - schema - Key - PRI - **primary** **key** - value - 8 - assigned to row - record - tuple - previous highest inserted in the table - entity - relation - value - 7 - **auto_increment** [1]

```sql
mysql> INSERT
    -> INTO person
    -> (name,age,sex,isStudent)
    -> VALUES ("Mary",30,"F",0);
Query OK, 1 row affected (0.01 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+--------+------+------+-----------+
| personID | name   | age  | sex  | isStudent |
+----------+--------+------+------+-----------+
|        1 | John   |   23 | M    |         1 |
|        2 | Mary   |   30 | F    |         0 |
|        3 | Tom    | NULL | M    |         0 |
|        4 | Alan   |   18 | M    |         1 |
|        5 | Laura  |   17 | F    |         1 |
|        6 | Bob    |   18 | M    |         0 |
|        7 | Johnny |   23 | M    |         1 |
|        8 | Mary   |   30 | F    |         0 |
+----------+--------+------+------+-----------+
8 rows in set (0.00 sec)
```

- no value specified for column - attribute - field - isStudent - row - record - tuple - value - 0 - **schema** - **Default** - 0 - if **no** **values** are **specified** **during** an **insert** - **column** - attribute - field - isStudent - **defaults** **to** **value** - 0 - row - record - tuple - Jonathan is not a student [1]

```sql
mysql> DESCRIBE person;
+-----------+---------------+------+-----+---------+----------------+
| Field     | Type          | Null | Key | Default | Extra          |
+-----------+---------------+------+-----+---------+----------------+
| personID  | int           | NO   | PRI | NULL    | auto_increment |
| name      | varchar(20)   | NO   |     | NULL    |                |
| age       | int           | YES  |     | NULL    |                |
| sex       | enum('M','F') | YES  |     | M       |                |
| isStudent | tinyint(1)    | YES  |     | 0       |                |
+-----------+---------------+------+-----+---------+----------------+
5 rows in set (0.00 sec)
```

```sql
mysql> INSERT
    -> INTO person
    -> (sex,age,name)
    -> VALUES ("M",23,"Jonathan");
Query OK, 1 row affected (0.01 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+----------+------+------+-----------+
| personID | name     | age  | sex  | isStudent |
+----------+----------+------+------+-----------+
|        1 | John     |   23 | M    |         1 |
|        2 | Mary     |   30 | F    |         0 |
|        3 | Tom      | NULL | M    |         0 |
|        4 | Alan     |   18 | M    |         1 |
|        5 | Laura    |   17 | F    |         1 |
|        6 | Bob      |   18 | M    |         0 |
|        7 | Johnny   |   23 | M    |         1 |
|        8 | Mary     |   30 | F    |         0 |
|        9 | Jonathan |   23 | M    |         0 |
+----------+----------+------+------+-----------+
9 rows in set (0.00 sec)
```

- **adding** new customer - **row** - record - tuple - to the database - customer did **not** **provide** **all** **data** - still **want** to **add** the customer - can **update** at a **later** time [1]

```sql
mysql> INSERT
    -> INTO person
    -> (name)
    -> VALUES ("Tommy");
Query OK, 1 row affected (0.01 sec)
```

- column - attribute - field - personID - value - 10 - schema - Extra - auto_increment - command - INSERT INTO - manually inserted column - attribute - field - value - Tommy - column - attribute - field - age - schema - Default - NULL - column - attribute - field - sex - schema - Default - M - column - attribute - field - isStudent - schema - Default - 0 [1]

```sql
mysql> SELECT *
    -> FROM person
    -> WHERE name="Tommy";
+----------+-------+------+------+-----------+
| personID | name  | age  | sex  | isStudent |
+----------+-------+------+------+-----------+
|       10 | Tommy | NULL | M    |         0 |
+----------+-------+------+------+-----------+
1 row in set (0.00 sec)
```

- columns - attributes - fields - age - sex - isStudent - command - INSERT INTO - row - record - tuple - 20 - F - 0 - mysql left to insert the remaining two columns - attributes - fields - schema - Extra - auto_increment - for column - attribute - field - personID - schema - Default - NULL - for column - attribute - field - name [1]

- schema - Default - NULL - mysql - does not insert anything into the table - entity - relation [1]

```sql
ERROR 1364 (HY000): Field 'name' doesn't have a default value
```

- schema - Null - NO - null value not allowed for the column - attribute - field - name - force user to enter some value for the row - record - tuple - most inportant value to be inserted into a table - entity - relation - is a persons name - all other values have default values or auto-incremented - cannot give a person a default name - NULL is a special value in - mysql - different from a string of zero characters or the number zero [1]

```sql
mysql> INSERT
    -> INTO person
    -> (age,sex,isStudent)
    -> VALUES (20,"F",0);
ERROR 1364 (HY000): Field 'name' doesn't have a default value
```

[MySQL Documentation](http://web.archive.org/web/20200803100245/https://dev.mysql.com/doc/refman/5.7/en/working-with-null.html)

***
# END